

def send_report_via_sms():
    account_sid = 'ACc0fb9078b0a79b48380326210fa0fddc'

    auth_token = 'ce04d00700e943e6fcb1a465a28c0106'
    client = Client(account_sid, auth_token)

    message = client.messages.create(
    from_='+15138224044',
            body = f'''नमस्ते, Harsh
                    उत्पाद का नाम: मक्का 🌽
                    समाप्ति तिथि: कल, 16-05-2025

                    उत्पाद का नाम: ज्वार 🌱
                    समाप्ति तिथि: कल, 16-05-2025

                    उत्पाद का नाम: गेहूं 🌾
                    समाप्ति तिथि: कल, 16-05-2025

                    उत्पाद का नाम: चावल 🌾
                    समाप्ति तिथि: कल, 16-05-2025

                    कृपया इन्हें जल्द से जल्द उपयोग करें या बाजार में बेचने के लिए विचार करें। धन्यवाद!''',
  to='+916202603974'
    )

    print(message.sid)